[
  {
    "name": "Aarakocra",
    "id": "aarakocra",
    "source": "MPMM",
    "size": "M",
    "speed": "30",
    "extraspeed": "fly equal to your walking speed",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Aarakocra reach maturity by age 3. Compared to humans, aarakocra live very short lives, rearely longer than 30 years."]
      },
      {
        "name": "Alignment",
        "text": ["Most aarakocra are good and rarely choose sides when it comes to law and chaos. Tribal leaders and warriors might be lawful, while explorers and adventurers might tend toward chaotic."]
      },
      {
        "name": "Size",
        "text": ["Aarakocra are about 5 feet tall. They have thin, lightweight bodies that weigh between 80 and 100 pounds."]
      },
      {
        "name": "Flight",
        "text": ["Because of your wings, you have a flying speed equal to your walking speed. To use this flying speed, your hands must be free and you can't be wearing medium or heavy armor."]
      },
      {
        "name": "Talons",
        "text": ["You have talons that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + STR slashing damage."]
      },
      {
        "name": "Wind Caller",
        "text": ["Starting at 3rd level, you can cast the {@spells gust of wind} spell with this trait, without requiring a material component. Once you cast the spell with this trait, you can't do so again until you finish a long rest. You can also cast the spell using any spell slots you have of 2nd level or higher.",
        "Intelligence, Wisdom, or Charisma is your spellcasting ability for when you cast gust of wind with this trait (choose when you select this race)."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and one other language of your choice."]
      }
    ]
  },
  {
    "name": "Aasimar",
    "id": "aasimar-protector",
    "source": "MPMM",
    "size": "S/M",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Aasimar mature at the same rate as humans, but they can live up to 160 years."]
      },
      {
        "name": "Alignment",
        "text": ["Aasimar are imbued with positive energy and tend towards Lawful and Good, but some have Fallen from their path, or forsaken a positive/negative duality altogether."]
      },
      {
        "name": "Size",
        "text": ["Aasimar have the same range of height and weight as humans."]
      },
      {
        "name": "Darkvision",
        "text": ["Blessed with a radiant soul, your vision can easily cut through darkness. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."]
      },
      {
        "name": "Celestial Resistance",
        "text": ["You have resistance to necrotic damage and radiant damage."]
      },
      {
        "name": "Healing Hands",
        "text": ["As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."]
      },
      {
        "name": "Light Bearer",
        "text": ["You know the light cantrip. Charisma is your spellcasting ability for it."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Celestial (Celestial could be replaced with one other language appropriate for your character)."]
      },
      {
        "name": "Celestial Revelation",
        "text": [
          "When you reach 3rd level, choose one of the revelation options below. Thereafter, you can use a bonus action to unleash the celestial energy within yourself. Your transformation lasts for 1 minute or until you end it as a bonus action. Once you transform using your revelation below, you can't use it again until you finish a long rest.",
          {
            "type": "list",
            "items": [
              {
                  "name": "Necrotic Shroud",
                  "type": "entries",
                  "entries": [
                    "Your eyes briefly become pools of darkness, and ghostly wings sprout from your back. Creatures within 10 feet of you that can see you must succeed on a Charisma save (DC 8 + prof + CHA) or become frightened of you until the end of your next turn. Until the transformation ends, once on each of your turns, you can deal necrotic damage equal to your proficiency bonus to one target when you deal damage to it."
                  ]
              },
              {
                  "name": "Radiant Consumption",
                  "type": "entries",
                  "entries": [
                    "Searing light temporarily radiates from your eyes and mouth. For the duration, you shed bright light in a 10-foot radius and dim light for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes radiant damage equal to your proficiency bonus.  Until the transformation ends, once on each of your turns, you can deal radiant damage equal to your proficiency bonus to one target when you deal damage to it."
                  ]
              },
              {
                  "name": "Radiant Soul",
                  "type": "entries",
                  "entries": [
                    "Two luminous, spectral wings sprout from your back temporarily. Until the transformation ends, you have a flying speed equal to your walking speed, and once on each of your turns, you can deal radiant damage equal to your proficiency bonus to one target when you deal damage to it."
                  ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "Centaur",
    "id": "centaur",
    "source": "MPMM",
    "size": "M",
    "speed": "40",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Centaurs mature and age at about the same rate as humans."]
      },
      {
        "name": "Alignment",
        "text": ["Centaurs are inclined toward neutrality. Those living in remote bands are more inclined to be chaotic, while those living in more populous communes tend to be lawful."]
      },
      {
        "name": "Size",
        "text": ["Centaurs stand between 6 and 7 feet tall, with their equine bodies reaching about 4 feet at the withers."]
      },
      {
        "name": "Fey",
        "text": ["Your creature type is fey, rather than humanoid."]
      },
      {
        "name": "Charge",
        "text": [
          "If you move at least 30 feet straight toward a target and then hit it with a melee weapon attack on the same turn, you can immediately follow that attack with a bonus action, making one attack against the target with your hooves."
        ]
      },
      {
        "name": "Hooves",
        "text": ["You have hooves that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + STR bludgeoning damage, instead of the bludgeoning damage normal for an unarmed strike."]
      },
      {
        "name": "Equine Build",
        "text": [
          "You count as one size larger when determining your carrying capacity and the weight you can push or drag.",
          "In addition, any climb that requires hands and feet is especially difficult for you because of your equine legs. When you make such a climb, each foot of movement costs you 4 extra feet, instead of the normal 1 extra foot."
        ]
      },
      {
        "name": "Natural Affinity",
        "text": [
          "Your fey connection to nature gives you an intuitive connection to the natural world and the animals within it. You therefore have proficiency in one of the following skills of your choice: Animal Handling, Medicine, Nature, or Survival."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Sylvan (Sylvan could be replaced with one other language appropriate for your character)."]
      }
    ]
  },
  {
    "name": "Changeling",
    "id": "changeling",
    "source": "MPMM",
    "size": "S/M",
    "speed": "30",
    "cha": 2,
    "choose": 1,
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Changelings mature slightly faster than humans but share a similar lifespan—typically a century or less. While a changeling can transform to conceal their age, the effects of aging affect them similarly to humans."]
      },
      {
        "name": "Alignment",
        "text": ["Changelings tend toward pragmatic neutrality, and few changelings embrace evil."]
      },
      {
        "name": "Size",
        "text": ["Changelings in their notural state are usually slightly smaller than humans."]
      },
      {
        "name": "Shapechanger",
        "text": [
          "As an action, you can change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height between Medium and Small. You can make yourself appear as a member of another ancestry, though none of your game statistics change. You can't duplicate the appearance of a creature you've never seen, and you must adopt a form that has the same basic arrangement of limbs that you have. Your clothing and equipment aren't changed by this trait.",
          "You stay in the new form until you use an action to revert to your true form or until you die."
        ]
      },
      {
        "name": "Changeling Instincts",
        "text": [
          "You gain proficiency with two of the following skills of your choice: Deception, Insight, Intimidation, and Persuasion."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and two other languages of your choice."]
      }
    ]
  },
  {
    "name": "Dragonborn",
    "id": "dragonborn",
    "size": "M",
    "source": "FTD",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 150."]
      },
      {
        "name": "Alignment",
        "text": ["Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil (represented by Bahamut and Tiamat, respectively)."]
      },
      {
        "name": "Size",
        "text": ["Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium."]
      },
      {
        "name": "Draconic Ancestry",
        "text": [
          "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in this table. Chromatic breath weapons are 15ft. cones while metallic breath weapons are 30ft x 5ft lines.",
          {
            "type": "table",
            "colLabels": [
              "Dragon",
              "Type"
            ],
            "colStyles": [
              "col-2 text-center",
              "col-8"
            ],
            "rows": [
              [
                "Violet/Platinum/Amethyst",
                "Radiant"
              ],
              [
                "Black/Lead/Obsidian",
                "Necrotic"
              ],
              [
                "Blue/Mercury/Sapphire",
                "Lightning"
              ],
              [
                "Red/Gold/Ruby",
                "Fire"
              ],
              [
                "White/Silver/Crystal",
                "Cold"
              ],
              [
                "Green/Iron/Emerald",
                "Acid"
              ],
              [
                "Orange/Iridium/Topaz",
                "Psychic"
              ]
            ]
          }
        ]
      },
      {
        "name": "Breath Weapon",
        "text": [
          "When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 30-ft line that is 5-ft wide or a 15-ft cone. Each creature in that area must make a Dexterity save (DC = 8+prof+CON). On a failed save, the creature takes 1d10 damage of the type associated with your Ancestry. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
          "You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        ]
      },
      {
        "name": "Damage Resistance",
        "text": ["You have resistance to the damage type associated with your draconic ancestry."]
      },
      {
        "name": "Gem Ancestry - Psionic Mind",
        "text": ["Starting at 3rd level, you can chennel you draconic energy to send telepathic messages to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand these messages, but it must be able to understand at least one language to comprehend them."]
      },
      {
        "name": "Chroatic Ancestry - Chromatic Warding",
        "text": ["Starting at 3rd level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to the damage type associated with your Chromatic Ancestry. Once you use this trait, you can't do so again until you finish a long rest."]
      },
      {
        "name": "Metallic Ancestry - Forceful Presence",
        "text": ["Starting at 3rd level, you can use your understanding of diplomacy or intimidation to guide a conversation in your favor. When you make a Charisma (Intimidation or Persuasion) check, you can do so with advantage. Once you use this trait, you can't do so again until you finish a short or long rest."]
      },
      {
        "name": "Dragon Flight",
        "text": ["Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can't do so again until you finish a long rest."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Draconic."]
      }
    ]
  },
  {
    "name": "Dwarf",
    "id": "dwarf",
    "size": "M",
    "source": "PHB",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years."]
      },
      {
        "name": "Alignment",
        "text": ["Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order."]
      },
      {
        "name": "Size",
        "text": ["Dwarves stand between 4 and 5 feet tall and average about 150 pounds."]
      },
      {
        "name": "Stout Build",
        "text": ["You speed is not reduced by wearing heavy armor."]
      },
      {
        "name": "Dwarven Resilience",
        "text": ["You have advantage on saving throws against poison, and you have resistance against poison damage."]
      },
      {
        "name": "Dwarven Combat Training",
        "text": ["You have proficiency with the {@items battleaxe}, {@items handaxe}, {@items light hammer}, and {@items warhammer}."]
      },
      {
        "name": "Tool Proficiency",
        "text": ["You gain proficiency with the artisan's tools of your choice: {@items smith's tools}, {@items brewer's supplies}, or {@items mason's tools}."]
      },
      {
        "name": "Stonecunning",
        "text": ["Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Dwarvish."]
      },
      {
        "name": "Dwarven Toughness",
        "text": ["Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."]
      },
      {
        "name": "Dwarven Armor Training",
        "text": ["You have proficiency with light and medium armor."]
      }
    ]
  },
  {
    "name": "Elf (Drow)",
    "id": "elf-drow",
    "size": "M",
    "source": "PHB",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "proficiency": "Perception",
    "traits": [
      {
        "name": "Age",
        "text": ["Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and are not known to die of old age."]
      },
      {
        "name": "Alignment",
        "text": ["Drow are unlike other elves in that the live their whole lives in mysterious and sprawling cities build in the Veins of the World. Even more so than their above-ground cousins they love freedom and self-expression, and often extend teh the point of vanity, mania, and embracing the darker side of chaos. Their society values and protects itself above all others, and so most who aren't outcast tend towards neutrality or outright evil."]
      },
      {
        "name": "Size",
        "text": ["Elves range from under 5 to over 6 feet tall and have slender builds."]
      },
      {
        "name": "Superior Darkvision",
        "text": ["Accustomed to the depths of the Veins, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."]
      },
      {
        "name": "Keen Senses",
        "text": ["You have proficiency in the Perception skill."]
      },
      {
        "name": "Fey Ancestry",
        "text": ["You have advantage on saving throws against being charmed, and magic can't put you to sleep."]
      },
      {
        "name": "Trance",
        "text": ["Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Elvish."]
      },
      {
        "name": "Sunlight Sensitivity",
        "text": ["You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight"]
      },
      {
        "name": "Drow Magic",
        "text": ["You know the {@spells dancing lights} cantrip. When you reach 3rd level, you can cast the {@spells faerie fire} spell once per day; you must finish a long rest in order to cast the spell again using this trait. When you reach 5th level, you can also cast the {@spells darkness} spell once per day; you must finish a long rest in order to cast the spell again using this trait. Charisma is your spellcasting ability for these spells."]
      },
      {
        "name": "Drow Weapon Training",
        "text": ["You have proficiency with rapiers, shortswords, and hand crossbows."]
      }
    ]
  },
  {
    "name": "Elf (High)",
    "id": "elf-high",
    "size": "M",
    "source": "PHB",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "proficiency": "Perception",
    "traits": [
      {
        "name": "Age",
        "text": ["Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and are not known to die of old age."]
      },
      {
        "name": "Alignment",
        "text": ["Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not."]
      },
      {
        "name": "Size",
        "text": ["Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."]
      },
      {
        "name": "Keen Senses",
        "text": ["You have proficiency in the Perception skill."]
      },
      {
        "name": "Fey Ancestry",
        "text": ["You have advantage on saving throws against being charmed, and magic can't put you to sleep."]
      },
      {
        "name": "Trance",
        "text": ["Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common, Elvish, and one extra language of your choice."]
      },
      {
        "name": "Elf Weapon Training",
        "text": ["You have proficiency with the longsword, shortsword, shortbow, and longbow."]
      },
      {
        "name": "Cantrip",
        "text": ["You know one cantrip of your choice from the {@spells ?spell-class-filter=wizard&spell-level-filter=0|wizard spell list}. Intelligence is your spellcasting ability for it."]
      }
    ]
  },
  {
    "name": "Elf (Wood)",
    "id": "elf-wood",
    "size": "M",
    "source": "PHB",
    "speed": "35",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "proficiency": "Perception",
    "traits": [
      {
        "name": "Age",
        "text": ["Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and are not known to die of old age."]
      },
      {
        "name": "Alignment",
        "text": ["Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not."]
      },
      {
        "name": "Size",
        "text": ["Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."]
      },
      {
        "name": "Keen Senses",
        "text": ["You have proficiency in the Perception skill."]
      },
      {
        "name": "Fey Ancestry",
        "text": ["You have advantage on saving throws against being charmed, and magic can't put you to sleep."]
      },
      {
        "name": "Trance",
        "text": ["Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Elvish."]
      },
      {
        "name": "Elf Weapon Training",
        "text": ["You have proficiency with the longsword, shortsword, shortbow, and longbow."]
      },
      {
        "name": "Fleet of Foot",
        "text": ["Your base walking speed increases to 35 feet."]
      },
      {
        "name": "Mask of the Wild",
        "text": ["You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."]
      }
    ]
  },
  {
    "name": "Elf (Eladrin)",
    "id": "elf-eladrin",
    "size": "M",
    "source": "PHB",
    "speed": "35",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "proficiency": "Perception",
    "traits": [
      {
        "name": "Age",
        "text": ["Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and are not known to die of old age."]
      },
      {
        "name": "Alignment",
        "text": ["Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not."]
      },
      {
        "name": "Size",
        "text": ["Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."]
      },
      {
        "name": "Keen Senses",
        "text": ["You have proficiency in the Perception skill."]
      },
      {
        "name": "Fey Ancestry",
        "text": ["You have advantage on saving throws against being charmed, and magic can't put you to sleep."]
      },
      {
        "name": "Trance",
        "text": ["Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Elvish."]
      },
      {
        "name": "Elf Weapon Training",
        "text": ["You have proficiency with the longsword, shortsword, shortbow, and longbow."]
      },
      {
        "name": "Seasonal",
        "text": [
          "Eladrin are elves native to the Feywild, a realm of beauty, unpredictable emotion, and boundless magic. An eladrin is associated with one of the four seasons of the Feywild and has coloration reminiscent of that season, which can also affect the eladrin's mood.",
          "Some eladrin remain associated with a particular season for their entire lives, whereas other eladrin transform, adopting characteristics of a new season. When finishing a long rest, any eladrin can change their season.",
          {
            "type": "list",
            "items": [
              {
                  "name": "Spring",
                  "type": "entries",
                  "entries": [
                    "The season of cheerfulness and celebration, marked by merriment as winter's sorrow passes."
                  ]
              },
              {
                  "name": "Summer",
                  "type": "entries",
                  "entries": [
                    "The season of boldness and aggression, a time of unfettered energy."
                  ]
              },
              {
                  "name": "Fall",
                  "type": "entries",
                  "entries": [
                    "The season of peace and goodwill, when summer's harvest is shared with all."
                  ]
              },
              {
                  "name": "Winter",
                  "type": "entries",
                  "entries": [
                    "The season of contemplation and dolor, when the vibrant energy of the world slumbers."
                  ]
              }
            ]
          }
        ]
      },
      {
        "name": "Fey Step",
        "text": [
          "As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. Once you use this trait, you can't do so again until you finish a short or long rest.",
          "When you reach 3rd level, your Fey Step gains an additional effect based on your season; if the effect requires a saving throw, the DC equals 8 + prof + CHA:",
          {
            "type": "list",
            "items": [
              {
                  "name": "Spring",
                  "type": "entries",
                  "entries": [
                    "You can teleport one willing creature you touch instead of yourself."
                  ]
              },
              {
                  "name": "Summer",
                  "type": "entries",
                  "entries": [
                    "Immediately after you use your Fey Step, each creature of your choice within 5 feet of you takes fire damage equal to CHA"
                  ]
              },
              {
                  "name": "Fall",
                  "type": "entries",
                  "entries": [
                    "Immediately after you use your Fey Step, up to two creatures of your choice within 10 feet of you must succeed on a Wisdom save or be charmed for 1 minute, or until damage is dealt to it."
                  ]
              },
              {
                  "name": "Winter",
                  "type": "entries",
                  "entries": [
                    "Immediately before you use your Fey Step, one creature of your choice within 5 feet of you must succeed on a Wisdom save or be frightened until the end of your next turn."
                  ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "Firbolg",
    "id": "firbolg",
    "size": "M",
    "source": "MPMM",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["As humanoids related to the fey, firbolg have long lifespans. A firbolg reaches adulthood around 50, and the oldest of them can live for 500 years."]
      },
      {
        "name": "Alignment",
        "text": ["As people who follow the rhythm of nature and see themselves as its caretakers, firbolg are typically neutral good. Evil firbolg are rare and are usually the sworn enemies of the rest of their kind."]
      },
      {
        "name": "Size",
        "text": ["Firbolg are between 7 and 8 feet tall and weigh between 240 and 300 pounds."]
      },
      {
        "name": "Firbolg Magic",
        "text": [
          "You can cast {@spells detect magic} and {@spells disguise self} with this trait. When you use this version of disguise self, you can seem up to 3 feet shorter or taller. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have.",
          "Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this ancestry)."
        ]
      },
      {
        "name": "Hidden Step",
        "text": ["As a bonus action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, or force someone to make a saving throw. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."]
      },
      {
        "name": "Powerful Build",
        "text": ["You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."]
      },
      {
        "name": "Speech of Beast and Leaf",
        "text": ["You have the ability to communicate in a limited manner with beasts and plants. They can understand the meaning of your words, though you have no special ability to understand them in return. You have advantage on all Charisma checks you make to influence them."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common, Elvish, and Giant. (Elvish and/or Giant could be replaced with other languages appropriate for your character)"]
      }
    ]
  },
  {
    "name": "Genasi (Air)",
    "id": "genasi-air",
    "size": "S/M",
    "source": "MPMM",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Genasi mature at about the same rate as humans and reach adulthood in their late teens. They live somewhat longer than humans do, up to 120 years."]
      },
      {
        "name": "Alignment",
        "text": ["Independent and self-reliant, genasi tend toward a neutral alignment."]
      },
      {
        "name": "Size",
        "text": ["Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall."]
      },
      {
        "name": "Unending Breath",
        "text": ["You can hold your breath indefinitely while you're not incapacitated."]
      },
      {
        "name": "Lightning Resistance",
        "text": ["You have resistance to lightning damage."]
      },
      {
        "name": "Mingle with the Wind",
        "text": [
          "You know the {@spells shocking grasp} cantrip. Starting at 3rd level, you can cast the {@spells feather fall} spell with this trait, without requiring a material component. Starting 5th level, you can also cast the {@spells levitate} spell with this trait, without requiring a material component. Once you cast feather fall or levitate with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.",
          "Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this ancestry)."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Primordial."]
      }
    ]
  },
  {
    "name": "Genasi (Earth)",
    "id": "genasi-earth",
    "size": "M",
    "source": "MPMM",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Genasi mature at about the same rate as humans and reach adulthood in their late teens. They live somewhat longer than humans do, up to 120 years."]
      },
      {
        "name": "Alignment",
        "text": ["Independent and self-reliant, genasi tend toward a neutral alignment."]
      },
      {
        "name": "Size",
        "text": ["Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall. Your size is Medium."]
      },
      {
        "name": "Earth Walk",
        "text": ["You can move across difficult terrain without expending extra movement if you are using your walking speed on the ground or a floor."]
      },
      {
        "name": "Merge with Stone",
        "text": [
          "You know the {@spells blade ward} cantrip. You can cast it as normal, and you can also cast it as a bonus action a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest.",
          "Starting at 5th level, you can cast the {@spells pass without trace} spell with this trait, without requiring a material component. Once you cast that spell with this trait, you can't do so again until you finish a long rest. You can also cast it using any spell slots you have of 2nd level or higher.",
          "Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this ancestry)."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Primordial."]
      }
    ]
  },
  {
    "name": "Genasi (Fire)",
    "id": "genasi-fire",
    "size": "M",
    "source": "MPMM",
    "speed": "30",
    "con": 2,
    "int": 1,
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Genasi mature at about the same rate as humans and reach adulthood in their late teens. They live somewhat longer than humans do, up to 120 years."]
      },
      {
        "name": "Alignment",
        "text": ["Independent and self-reliant, genasi tend toward a neutral alignment."]
      },
      {
        "name": "Size",
        "text": ["Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall. Your size is Medium."]
      },
      {
        "name": "Fire Resistance",
        "text": ["You have resistance to fire damage."]
      },
      {
        "name": "Reach to the Blaze",
        "text": [
          "You know the {@spells produce flame} cantrip. Starting at 3rd level, you can cast the {@spells burning hands} spell with this trait. Starting at 5th level, you can also cast the {@spells flame blade} spell with this trait, without a material component. Once you cast burning hands or flame blade with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.",
          "Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Primordial."]
      }
    ]
  },
  {
    "name": "Genasi (Water)",
    "id": "genasi-water",
    "size": "M",
    "source": "MPMM",
    "speed": "30",
    "con": 2,
    "wis": 1,
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Genasi mature at about the same rate as humans and reach adulthood in their late teens. They live somewhat longer than humans do, up to 120 years."]
      },
      {
        "name": "Alignment",
        "text": ["Independent and self-reliant, genasi tend toward a neutral alignment."]
      },
      {
        "name": "Size",
        "text": ["Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall. Your size is Medium."]
      },
      {
        "name": "Amphibious",
        "text": ["You can breathe air and water and you have a swimming speed equal to your walking speed."]
      },
      {
        "name": "Acid Resistance",
        "text": ["You have resistance to acid damage."]
      },
      {
        "name": "Call to the Wave",
        "text": ["You know the {@spells acid splash} cantrip. Starting at 3rd level, you can cast the {@spells create or destroy water} spell with this trait. Starting at 5th level, you can also cast the {@spells water walk} spell with this trait, without requiring a material component. Once you cast create or destroy water or water walk with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.",
        "Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Primordial."]
      }
    ]
  },
  {
    "name": "Gnome (Forest)",
    "id": "gnome-forest",
    "size": "S",
    "source": "PHB",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years."]
      },
      {
        "name": "Alignment",
        "text": ["Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."]
      },
      {
        "name": "Size",
        "text": ["Gnomes are between 3 and 4 feet tall and average about 40 pounds."]
      },
      {
        "name": "Gnome Cunning",
        "text": ["You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Gnomish."]
      },
      {
        "name": "Natural Illusionist",
        "text": ["You know the {@spells minor illusion} cantrip. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this race)."]
      },
      {
        "name": "Speak with Small Beasts",
        "text": ["Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts. Forest gnomes love animals and often keep squirrels, badgers, rabbits, moles, woodpeckers, and other creatures as beloved pets."]
      }
    ]
  },
  {
    "name": "Gnome (Rock)",
    "id": "gnome-rock",
    "source": "PHB",
    "size": "S",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years."]
      },
      {
        "name": "Alignment",
        "text": ["Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."]
      },
      {
        "name": "Size",
        "text": ["Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small."]
      },
      {
        "name": "Gnome Cunning",
        "text": ["You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Gnomish."]
      },
      {
        "name": "Artificer's Lore",
        "text": ["Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."]
      },
      {
        "name": "Tinker",
        "text": [
          "You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.",
          "When you create a device, choose one of the following options:",
          "Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.",
          "Fire Starter. The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.",
          "Music Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed."
        ]
      }
    ]
  },
  {
    "name": "Goliath",
    "id": "goliath",
    "size": "M",
    "source": "MPMM",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "proficiency": "Athletics",
    "traits": [
      {
        "name": "Age",
        "text": ["Goliaths have lifespans comparable to humans. They enter adulthood in their late teens and usually live less than a century."]
      },
      {
        "name": "Alignment",
        "text": ["Goliath society, with its clear roles and tasks, has a strong lawful bent. The goliath sense of fairness, balanced with an emphasis on self sufficiency and personal accountability, pushes them toward neutrality."]
      },
      {
        "name": "Size",
        "text": ["Goliaths are between 7 and 8 feet tall and weigh between 280 and 340 pounds."]
      },
      {
        "name": "Little Giant",
        "text": ["You have proficiency in the Athletics skill, and you count as one size larger when determining your carrying weight and the weight you can push, drag, or lift."]
      },
      {
        "name": "Stone's Endurance",
        "text": ["You can supernaturally draw on unyielding stone to shrug off harm. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled and reduce the damage by that total.",
        "You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."]
      },
      {
        "name": "Mountain Born",
        "text": ["You have resistance to cold damage. You also naturally acclimate to high altitudes, even if you've never been to one. This includes elevations above 20,000 feet."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Giant. (Giant could be replaced with another language appropriate for your character)"]
      }
    ]
  },
  {
    "name": "Half-Elf",
    "id": "half-elf",
    "source": "PHB",
    "size": "M",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 300 years."]
      },
      {
        "name": "Alignment",
        "text": ["Half-elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others' demands, and sometimes prove unreliable, or at least unpredictable."]
      },
      {
        "name": "Size",
        "text": ["Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium."]
      },
      {
        "name": "Ability Score Increase",
        "text": ["An ability score of your choice increase by 1."]
      },
      {
        "name": "Fey Ancestry",
        "text": ["You have advantage on saving throws against being charmed, and magic can't put you to sleep."]
      },
      {
        "name": "Skill Versatility",
        "text": ["You gain proficiency in two skills of your choice."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common, Elvish, and one extra language of your choice."]
      }
    ]
  },
  {
    "name": "Half-Orc",
    "id": "half-orc",
    "size": "M",
    "source": "PHB",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "proficiency": "Intimidation",
    "traits": [
      {
        "name": "Age",
        "text": ["Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years."]
      },
      {
        "name": "Alignment",
        "text": ["Half-orcs inherit a tendency toward chaos from their orc parents. Half-orcs raised among orcs and willing to live out their lives among them are usually evil."]
      },
      {
        "name": "Size",
        "text": ["Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall."]
      },
      {
        "name": "Menacing",
        "text": ["You gain proficiency in the Intimidation skill."]
      },
      {
        "name": "Relentless Endurance",
        "text": ["When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest."]
      },
      {
        "name": "Savage Attacks",
        "text": ["When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."]
      }
    ]
  },
  {
    "name": "Halfling (Ghostwise)",
    "id": "halfling-ghostwise",
    "size": "S",
    "source": "SCAG",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century."]
      },
      {
        "name": "Alignment",
        "text": ["Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways."]
      },
      {
        "name": "Size",
        "text": ["Halflings average about 3 feet tall and weigh about 40 pounds."]
      },
      {
        "name": "Lucky",
        "text": ["When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."]
      },
      {
        "name": "Brave",
        "text": ["You have advantage on saving throws against being frightened."]
      },
      {
        "name": "Halfling Nimbleness",
        "text": ["You can move through the space of any creature that is of a size larger than yours."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Halfling."]
      },
      {
        "name": "Silent Speech",
        "text": ["You can speak telepathically to any creature within 30 feet of you. The creature understands you only if the two of you share a language. You can speak telepathically in this way to one creature at a time."]
      }
    ]
  },
  {
    "name": "Halfling (Lightfoot)",
    "id": "halfling-lightfoot",
    "size": "S",
    "source": "PHB",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century."]
      },
      {
        "name": "Alignment",
        "text": ["Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways."]
      },
      {
        "name": "Size",
        "text": ["Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small."]
      },
      {
        "name": "Lucky",
        "text": ["When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."]
      },
      {
        "name": "Brave",
        "text": ["You have advantage on saving throws against being frightened."]
      },
      {
        "name": "Halfling Nimbleness",
        "text": ["You can move through the space of any creature that is of a size larger than yours."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Halfling."]
      },
      {
        "name": "Naturally Stealthy",
        "text": ["You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."]
      }
    ]
  },
  {
    "name": "Halfling (Stout)",
    "id": "halfling-stout",
    "size": "S",
    "source": "PHB",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century."]
      },
      {
        "name": "Alignment",
        "text": ["Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways."]
      },
      {
        "name": "Size",
        "text": ["Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small."]
      },
      {
        "name": "Lucky",
        "text": ["When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."]
      },
      {
        "name": "Brave",
        "text": ["You have advantage on saving throws against being frightened."]
      },
      {
        "name": "Halfling Nimbleness",
        "text": ["You can move through the space of any creature that is of a size larger than yours."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Halfling."]
      },
      {
        "name": "Stout Resilience",
        "text": ["You have advantage on saving throws against poison, and you have resistance against poison damage."]
      }
    ]
  },
  {
    "name": "Human",
    "id": "human",
    "source": "PHB",
    "size": "M",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Humans reach adulthood in their late teens and live less than a century."]
      },
      {
        "name": "Alignment",
        "text": ["Humans tend toward no particular alignment."]
      },
      {
        "name": "Size",
        "text": ["Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."]
      },
      {
      "name": "Languages",
      "text": ["You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."]
      },
      {
      "name": "Skills",
      "text": ["You gain proficiency in one skill of your choice."]
      },
      {
      "name": "Feat",
      "text": ["You gain one feat of your choice."]
      }
    ]
  },
  {
    "name": "Kenku",
    "id": "kenku",
    "source": "MPMM",
    "size": "S/M",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Kenku have shorter lifespans than humans. They reach maturity at about 12 years old and can live to 60."]
      },
      {
        "name": "Alignment",
        "text": ["Kenku are chaotic creatures, rarely making enduring commitments, and they care mostly for preserving their own hides. They are generally chaotic neutral in outlook."]
      },
      {
        "name": "Size",
        "text": ["Kenku are usually between 4 and 5 feet tall and weigh between 70 and 120 pounds."]
      },
      {
      "name": "Languages",
      "text": ["You can read and write Common and one other language of your choice, but you can only speak using your Mimicry trait."]
      },
      {
      "name": "Expert Duplication",
      "text": ["When you copy writing or craftwork produced by yourself or someone else, you have advantage on any ability checks you make to produce an exact duplicate."]
      },
      {
      "name": "Kenku Recall",
      "text": [
        "Thanks to your supernaturally good memory, you have proficiency in two skills of your choice.",
        "Moreover, when you make an ability check using any skill in which you have proficiency, you can give yourself advantage on the check before rolling the d20. You can give yourself advantage in this way a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
      },
      {
        "name": "Mimicry",
        "text": ["You can accurately mimic sounds you have heard, including voices. A creature that hears the sounds you make can tell they are imitations only with a successful Wisdom (Insight) check against a DC of 8 + prof + CHA."]
      }
    ]
  },
  {
    "name": "Tiefling",
    "id": "tiefling",
    "size": "M",
    "source": "PHB",
    "speed": "30",
    "cha": 2,
    "int": 1,
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Tieflings mature at the same rate as humans but live a few years longer."]
      },
      {
        "name": "Alignment",
        "text": ["Tieflings might not have an innate tendency toward evil, but because of their circumstances, many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment."]
      },
      {
        "name": "Size",
        "text": ["Tieflings are about the same size and build as humans. Your size is Medium."]
      },
      {
        "name": "Darkvision",
        "text": ["Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."]
      },
      {
        "name": "Hellish Resistance",
        "text": ["You have resistance to fire damage."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and Infernal."]
      },
      {
        "name": "Devilish Heritages",
        "text": [
          "Tieflings can be born of a variety of devilish heritages. Choose one from below. ",
          "You learn the listed cantrip. Starting at 3rd level, you can cast the 1st level spell with this trait. Starting at 5th level, you can also cast the 2nd level spell with this trait. Once you cast the 1st or 2nd level spell with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.",
          "Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race).",
          {
            "type": "table",
            "colLabels": [
              "Hell",
              "Cantrip",
              "1st",
              "2nd"
            ],
            "colStyles": [
              "col-3",
              "col-3",
              "col-3",
              "col-3"
            ],
            "rows": [
              [
                "Avernian",
                "thaumaturgy",
                "searing smite",
                "branding smite"
              ],
              [
                "Canian",
                "mage hand",
                "burning hands",
                "flame blade"
              ],
              [
                "Stygian",
                "ray of frost",
                "armor of agathys",
                "darkness"
              ],
              [
                "Malbolgian",
                "minor illusion",
                "disguise self",
                "invisibility"
              ],
              [
                "Phlegethan",
                "friends",
                "charm person",
                "suggestion"
              ],
              [
                "Disan",
                "thaumaturgy",
                "disguise self",
                "detect thoughts"
              ],
              [
                "Nessian",
                "thaumaturgy",
                "hellish rebuke",
                "darkness"
              ]
            ]
          }
        ]
      },
      {
        "name": "Appearance",
        "text": ["Your tiefling might not look like other tieflings. You might choose 1d4 + 1 of the following features: small horns; fangs or sharp teeth; a forked tongue; catlike eyes; six fingers on each hand; goatlike legs; cloven hoofs; a forked tail; leathery or scaly skin; red or dark blue skin; cast no shadow or reflection; exude a smell of brimstone"]
      }
    ]
  },
  {
    "name": "Shifter",
    "id": "shifter",
    "source": "MPMM",
    "size": "M",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Shifters are quick to mature both physically and emotionally, reaching young adulthood at age 10. They rarely live to be more than 70 years old."]
      },
      {
        "name": "Alignment",
        "text": ["Shifters tend toward neutrality, being more focused on survival than concepts of good and evil. A love of personal freedom can drive shifters toward chaotic alignments."]
      },
      {
        "name": "Size",
        "text": ["Shinters are human-sized, often growing slightly larger when shifting"]
      },
      {
        "name": "Darkvision",
        "text": ["You have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."]
      },
      {
        "name": "Shifting",
        "text": [
          "As a bonus action, you can assume a more bestial appearance. This transformation lasts for 1 minute, until you die, or until you revert to your normal appearance as a bonus action. When you shift, you gain temporary hit points equal to 2 times your proficiency bonus. You can shift a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        ]
      },
      {
        "name": "Shifting Feature",
        "text": [
          "Whenever you shift, you gain an additional benefit based on one of the following options (choose when you select this race):",
          "Beasthide. You gain 1d6 additional temporary hit points. While shifted, you have a +1 bonus to your Armor Class.",
          "Longtooth. When you shift and as a bonus action on your turn while shifted, you can use your elongated fangs to make an unarmed strike. If you hit with your fangs, you can deal piercing damage equal to 1d6 + STR.",
          "Swiftstride. While shifted, your walking speed increases by 10 feet. Additionally, you can move up to 10 feet as a reaction when a creature ends its turn within 5 feet of you without provoking opportunity attacks.",
          "Wildhunt. While shifted, you have advantage on Wisdom checks, and no creature within 30 feet of you can make an attack roll with advantage against you unless you're incapacitated."
        ]
      },
      {
        "name": "Bestial Instincts",
        "text": [
          "Channeling the beast within, you have proficiency in one of the following skills of your choice: Acrobatics, Athletics, Intimidation, or Survival."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common."]
      }
    ]
  },
  {
    "name": "Tabaxi",
    "id": "tabaxi",
    "source": "MPMM",
    "size": "M",
    "speed": "30",
    "extraspeed": "climb equal to your walking speed",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Tabaxi have lifespans similar to humans. They reach adulthood in their late teens and live less than a century."]
      },
      {
        "name": "Alignment",
        "text": ["Tabaxi tend toward chaotic alignments, as they let impulse and fancy guide their decisions. They are rarely evil, with most of them driven by curiosity rather than greed or other dark impulses."]
      },
      {
        "name": "Size",
        "text": ["Tabaxi are taller on average than humans and relatively slender."]
      },
      {
        "name": "Darkvision",
        "text": ["You have a cat's keen senses, especially in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."]
      },
      {
        "name": "Cat's Claws",
        "text": ["Because of your claws,  you have a climbing speed equal to your walking speed. In addition, you can use your claws to make unarmed strikes. When you hit with them, the strike deals 1d6 + STR slashing damage."]
      },
      {
        "name": "Feline Agility",
        "text": ["Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."]
      },
      {
        "name": "Cat's Talents",
        "text": ["You have proficiency in the Perception and Stealth skills."]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and one other language of your choice."]
      }
    ]
  },
  {
    "name": "Tortle",
    "id": "tortle",
    "source": "MPMM",
    "size": "M",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Young tortles crawl for a few weeks after birth before learning to walk on two legs. They reach adulthood by the age of 15 and live an average of 120 years."]
      },
      {
        "name": "Alignment",
        "text": ["Tortles tend to lead orderly, ritualistic lives. They develop customs and routines, becoming more set in their ways as they age. Most are lawful good. A few can be selfish and greedy, tending more toward evil, but it's unusual for a tortle to shuck off order in favor of chaos."]
      },
      {
        "name": "Size",
        "text": ["Tortle adults stand 5 to 6 feet tall and average 450 pounds. Their shells account for roughly one-third of their weight."]
      },
      {
        "name": "Claws",
        "text": ["You have claws that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + STR slashing damage."]
      },
      {
        "name": "Hold Breath",
        "text": ["You can hold your breath for up to 1 hour at a time. Tortles aren't natural swimmers, but they can remain underwater for some time before needing to come up for air."]
      },
      {
        "name": "Natural Armor",
        "text": ["Your shell provides you a base AC of 17 (your Dexterity modifier doesn't affect this number). Your shell and the shape of your body means you can't wear light, medium, or heavy armor, but if you are using a shield, you can apply the shield's bonus as normal."]
      },
      {
        "name": "Shell Defense",
        "text": [
          "You can withdraw into your shell as an action. Until you emerge, you gain a +4 bonus to AC, and you have advantage on Strength and Constitution saving throws. While in your shell, you are prone, your speed is 0 and can't increase, you have disadvantage on Dexterity saving throws, you can't take reactions, and the only action you can take is a bonus action to emerge from your shell."
        ]
      },
      {
        "name": "Nature's Intuition",
        "text": [
          "Thanks to your mystical connection to nature, you gain proficiency with one of the following skills of your choice: Animal Handling, Medicine, Nature, Perception, Stealth, or Survival."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Aquan and Common."]
      }
    ]
  },
  {
    "name": "Grung",
    "id": "grung",
    "source": "OTHER",
    "size": "S",
    "speed": "25",
    "extraspeed": "25 ft. climbing",
    "dex": 2,
    "con": 1,
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Grungs mature to adulthood in a single year, but have been known to live up to 50 years."]
      },
      {
        "name": "Alignment",
        "text": ["Most grungs are lawful, having been raised in a strict caste system. They tend toward evil as well, coming from a culture where social advancement occurs rarely, and most often because another member of your army has died and there is no one else of that caste to fill the vacancy."]
      },
      {
        "name": "Size",
        "text": ["Grungs stand between 2½ and 3½ feet tall and average about 30 pounds. Your size is Small."]
      },
      {
        "name": "Arboreal Alertness",
        "text": ["You have proficiency in the Perception skill."]
      },
      {
        "name": "Amphibious",
        "text": ["You can breathe air and water."]
      },
      {
        "name": "Poison Immunity",
        "text": ["You're immune to poison damage and the poisoned condition."]
      },
      {
        "name": "Poisonous Skin",
        "text": [
          "Any creature that grapples you or otherwise comes into direct contact with your skin must succeed on a DC 12 Constitution saving throw or become poisoned for 1 minute. A poisoned creature no longer in direct contact with you can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
          "You can also apply this poison to any piercing weapon as part of an attack with that weapon, though when you hit the poison reacts differently. The target must succeed on a DC 12 Constitution saving throw or take 2d4 poison damage."
        ]
      },
      {
        "name": "Standing Leap",
        "text": [
          "Your long jump is up to 25 feet and your high jump is up to 15 feet, with or without a running start."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Grung."]
      },
      {
        "name": "Water Dependancy",
        "text": ["If you fail to immerse yourself in water for at least 1 hour during a day, you suffer one level of exhaustion at the end of that day. You can only recover from this exhaustion through magic or by immersing yourself in water for at least 1 hour."]
      }
    ]
  },
  {
    "name": "Warforged",
    "id": "warforged",
    "source": "ERLW",
    "size": "M",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2; any other +1 (b) Any +1; any other +1; any other +1",
    "traits": [
      {
        "name": "Age",
        "text": ["A typical warforged is between two and thirty years old. The maximum warforged lifespan remains a mystery; so far, warforged have shown no signs of deterioration due to age. You are immune to magical aging effects."]
      },
      {
        "name": "Alignment",
        "text": ["Most warforged take comfort in order and discipline, tending toward law and neutrality. But some have absorbed the morality, or lack thereof, of the beings with which they served."]
      },
      {
        "name": "Size",
        "text": ["Your size in Medium."]
      },
      {
        "name": "Sentry's Rest",
        "text": ["When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you unconscious, and you can see and hear as normal."]
      },
      {
        "name": "Constructed Resilience",
        "text": [
          "You were created to have remarkable fortitude, represented by the following benefits:",
          "You have advantage on saving throws against being poisoned, and you have resistance to poison damage.",
          "You don't need to eat, drink, or breathe.",
          "You are immune to disease.",
          "You don't need to sleep, and magic can't put you to sleep."
        ]
      },
      {
        "name": "Integrated Protection",
        "text": [
          "Your body has built-in defensive layers, which can be enhanced with armor:",
          "You gain a +1 bonus to Armor Class.",
          "You can don only armor with which you have proficiency. To don armor other than a shield, you must incorporate it into your body over the course of 1 hour, during which you remain in contact with the armor. To doff armor, you must spend 1 hour removing it. You can rest while donning or doffing armor in this way.",
          "While you live, the armor incorporated into your body can't be removed against your will."
        ]
      },
      {
        "name": "Specialized Design",
        "text": [
          "You gain one skill proficiency and one tool proficiency of your choice."
        ]
      },
      {
        "name": "Languages",
        "text": ["You can speak, read, and write Common and one other language of your choice."]
      }
    ]
  }
]
