[
  {
    "name": "Aasimar",
    "id": "aasimar",
    "source": "PHB'24",
    "size": "S/M",
    "speed": "30",
    "traits": [
      {
        "name": "Age",
        "text": ["Aasimar can arise among any population of mortals. They grow as their parents did until they reach the prime of their life when most Aasimar will 'pause' aging for decades before they begin to grow old. Most Aasimar live two or three times as long as their mortal ancestry would suggest."]
      },
      {
        "name": "Alignment",
        "text": ["Aasimar are imbued with positive energy and tend towards Lawful and Good, but some have Fallen from their path, or forsaken a positive/negative duality altogether."]
      },
      {
        "name": "Size",
        "text": ["Aasimar have the same range of height and weight as their parents."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Celestial Resistance",
        "entries": [
          "You have {@rule Resistance} to Necrotic damage and Radiant damage."
        ]
      },
      {
        "type": "entries",
        "name": "Darkvision",
        "entries": [
          "You have {@sense Darkvision} with a range of 60 feet."
        ]
      },
      {
        "type": "entries",
        "name": "Healing Hands",
        "entries": [
          "As a {@action Magic} action, you touch a creature and roll a number of d4s equal to your {@rule Proficiency|Proficiency Bonus}. The creature regains a number of {@rule Hit Points} equal to the total rolled. Once you use this trait, you can't use it again until you finish a {@rule Long Rest}."
        ]
      },
      {
        "type": "entries",
        "name": "Light Bearer",
        "entries": [
          "You know the {@spell Light} cantrip. Charisma is your spellcasting ability for it."
        ]
      },
      {
        "type": "entries",
        "name": "Celestial Revelation",
        "entries": [
          "When you reach character level 3, you can transform as a {@rule Bonus Action} using one of the options below (choose the option each time you transform). The transformation lasts for 1 minute or until you end it (no action required). Once you transform, you can't do so again until you finish a {@rule Long Rest}.",
          "Once on each of your turns before the transformation ends, you can deal extra damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your {@rule Proficiency|Proficiency Bonus}, and the extra damage's type is either Necrotic for Necrotic Shroud or Radiant for Heavenly Wings and Inner Radiance.",
          "Here are the transformation options:",
          {
            "type": "list",
            "style": "list-hang-notitle",
            "items": [
              {
                "type": "item",
                "name": "Heavenly Wings",
                "entries": [
                  "Two spectral wings sprout from your back temporarily. Until the transformation ends, you have a {@rule Fly Speed} equal to your {@rule Speed}."
                ]
              },
              {
                "type": "item",
                "name": "Inner Radiance",
                "entries": [
                  "Searing light temporarily radiates from your eyes and mouth. For the duration, you shed {@rule Bright Light} in a 10-foot radius and {@rule Dim Light} for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes Radiant damage equal to your {@rule Proficiency|Proficiency Bonus}."
                ]
              },
              {
                "type": "item",
                "name": "Necrotic Shroud",
                "entries": [
                  "Your eyes briefly become pools of darkness, and flightless wings sprout from your back temporarily. Creatures other than your allies within 10 feet of you must succeed on a Charisma saving throw (DC 8 plus your Charisma modifier and {@rule Proficiency|Proficiency Bonus}) or have the {@condition Frightened} condition until the end of your next turn."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "Dragonborn",
    "id": "dragonborn",
    "size": "M",
    "source": "PHB'24",
    "speed": "30",
    "traits": [
      {
        "name": "Age",
        "text": ["Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 150."]
      },
      {
        "name": "Alignment",
        "text": ["Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil (represented by Bahamut and Tiamat, respectively)."]
      },
      {
        "name": "Size",
        "text": ["Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Draconic Ancestry",
        "entries": [
          "Your lineage stems from a dragon progenitor. Choose the kind of dragon from the Draconic Ancestors table. Your choice affects your Breath Weapon and {@rule Damage} {@rule Resistance} traits as well as your appearance.",
          {
            "type": "table",
            "caption": "Draconic Ancestors",
            "colLabels": [
              "Dragon",
              "Damage Type"
            ],
            "colStyles": [
              "col-6",
              "col-6"
            ],
            "rows": [
              [
                "White/Silver/Crystal",
                "Cold"
              ],
              [
                "Blue/Mercury/Sapphire",
                "Lightning"
              ],
              [
                "Black/Lead/Obsidian",
                "Necrotic"
              ],
              [
                "Red/Gold/Ruby",
                "Fire"
              ],
              [
                "Green/Iron/Emerald",
                "Acid"
              ],
              [
                "Orange/Platinum/Topaz",
                "Psychic"
              ],
              [
                "Violet/Antimony/Amethyst",
                "Radiant"
              ]
            ]
          }
        ]
      },
      {
        "type": "entries",
        "name": "Breath Weapon",
        "entries": [
          "When you take the {@action Attack} action on your turn, you can replace one of your attacks with an exhalation of magical energy in either a 15-foot Cone or a 30-foot Line that is 5 feet wide (choose the shape each time). Each creature in that area must make a Dexterity saving throw (DC 8 plus your Constitution modifier and {@rule Proficiency|Proficiency Bonus}). On a failed save, a creature takes {@damage 1d10} damage of the type determined by your Draconic Ancestry trait. On a successful save, a creature takes half as much damage. This damage increases by {@dice 1d10} when you reach character levels 5 ({@dice 2d10}), 11 ({@dice 3d10}), and 17 ({@dice 4d10}).",
          "You can use this Breath Weapon a number of times equal to your {@rule Proficiency}, and you regain all expended uses when you finish a {@rule Long Rest}."
        ]
      },
      {
        "type": "entries",
        "name": "Damage Resistance",
        "entries": [
          "You have {@rule Resistance} to the damage type determined by your Draconic Ancestry trait."
        ]
      },
      {
        "type": "entries",
        "name": "Darkvision",
        "entries": [
          "You have {@sense Darkvision} with a range of 60 feet."
        ]
      },
      {
        "type": "entries",
        "name": "Draconic Flight",
        "entries": [
          "When you reach character level 5, you can channel draconic magic to give yourself temporary flight. As a {@rule Bonus Action}, you sprout spectral wings on your back that last for 10 minutes or until you retract the wings (no action required) or have the {@condition Incapacitated} condition. During that time, you have a {@rule Fly Speed} equal to your {@rule Speed}. Your wings appear to be made of the same energy as your Breath Weapon. Once you use this trait, you can't use it again until you finish a {@rule Long Rest}."
        ]
      }
    ]
  },
  {
    "name": "Dwarf",
    "id": "dwarf",
    "size": "M",
    "source": "PHB'24",
    "speed": "30",
    "ability": "Choose one of: (a) Any +2/+1 (b) Any three +1",
    "traits": [
      {
        "name": "Age",
        "text": ["Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years."]
      },
      {
        "name": "Alignment",
        "text": ["Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order."]
      },
      {
        "name": "Size",
        "text": ["Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Darkvision",
        "entries": [
          "You have {@sense Darkvision} with a range of 120 feet."
        ]
      },
      {
        "type": "entries",
        "name": "Dwarven Resilience",
        "entries": [
          "You have {@rule Resistance} to Poison damage. You also have {@rule Advantage} on saving throws you make to avoid or end the {@condition Poisoned} condition."
        ]
      },
      {
        "type": "entries",
        "name": "Dwarven Toughness",
        "entries": [
          "Your {@rule Hit Points|Hit Point} maximum increases by 1, and it increases by 1 again whenever you gain a level."
        ]
      },
      {
        "type": "entries",
        "name": "Stonecunning",
        "entries": [
          "As a {@rule Bonus Action}, you gain {@sense Tremorsense} with a range of 60 feet for 10 minutes. You must be on a stone surface or touching a stone surface to use this {@sense Tremorsense}. The stone can be natural or worked.",
          "You can use this {@rule Bonus Action} a number of times equal to your {@rule Proficiency|Proficiency Bonus}, and you regain all expended uses when you finish a {@rule Long Rest}."
        ]
      }
    ]
  },
  {
    "name": "Elf",
    "id": "elf",
    "size": "M",
    "source": "PHB'24",
    "speed": "30",
    "proficiency": "Perception",
    "traits": [
      {
        "name": "Age",
        "text": ["Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100. Elves are not known to die of old age."]
      },
      {
        "name": "Alignment",
        "text": ["Elves love freedom, variety, and self-expression. High and Wood elves are pro-social and lean toward the gentler aspects of chaos. And though they also value other's freedom, their indefinite lifespan means they tend toward neutrality and bias toward and extremely long timeline","Their Drow cousins in the Veins go beyond desiring freedom to to the point vanity, mania, and a darker side of chaos. This dangerous underground societies and protects themselves above all others, and so most who aren't outcast tend towards outright selfishness and evil."]
      },
      {
        "name": "Size",
        "text": ["Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Darkvision",
        "entries": [
          "You have {@sense Darkvision} with a range of 60 feet."
        ]
      },
      {
        "type": "entries",
        "name": "Elven Lineage",
        "entries": [
          "You are part of a lineage that grants you supernatural abilities. Choose a lineage from the Elven Lineages table. You gain the level 1 benefit of that lineage.",
          "When you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a {@rule Long Rest}. You can also cast the spell using any spell slots you have of the appropriate level.",
          "Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage).",
          {
            "type": "table",
            "caption": "Elven Lineages",
            "colLabels": [
              "Lineage",
              "Level 1",
              "Level 3",
              "Level 5"
            ],
            "colStyles": [
              "col-2",
              "col-6",
              "col-2",
              "col-2"
            ],
            "rows": [
              [
                "Drow",
                "The range of your Darkvision increases to 120 feet. You also know the {@spell Dancing Lights} cantrip.",
                "{@spell Faerie Fire}",
                "{@spell Darkness}"
              ],
              [
                "High Elf",
                "You know the {@spell Prestidigitation} cantrip. Whenever you finish a Long Rest, you can replace that cantrip with a different {@filter cantrip from the Wizard spell list|spells|level=0|class=Wizard}.",
                "{@spell Detect Magic}",
                "{@spell Misty Step}"
              ],
              [
                "Wood Elf",
                "Your Speed increases to 35 feet. You also know the {@spell Druidcraft} cantrip.",
                "{@spell Longstrider}",
                "{@spell Pass without Trace}"
              ]
            ]
          }
        ]
      },
      {
        "type": "entries",
        "name": "Fey Ancestry",
        "entries": [
          "You have {@rule Advantage} on saving throws you make to avoid or end the {@condition Charmed} condition."
        ]
      },
      {
        "type": "entries",
        "name": "Keen Senses",
        "entries": [
          "You have proficiency in the {@skill Insight}, {@skill Perception}, or {@skill Survival} skill."
        ]
      },
      {
        "type": "entries",
        "name": "Trance",
        "entries": [
          "You don't need to sleep, and magic can't put you to sleep. You can finish a {@rule Long Rest} in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness."
        ]
      }
    ]
  },
  {
    "name": "Gnome",
    "id": "gnome",
    "size": "S",
    "source": "PHB'24",
    "speed": "30",
    "traits": [
      {
        "name": "Age",
        "text": ["Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years."]
      },
      {
        "name": "Alignment",
        "text": ["Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."]
      },
      {
        "name": "Size",
        "text": ["Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Darkvision",
        "entries": [
          "You have {@sense Darkvision} with a range of 60 feet."
        ]
      },
      {
        "type": "entries",
        "name": "Gnomish Cunning",
        "entries": [
          "You have {@rule Advantage} on Intelligence, Wisdom, and Charisma saving throws."
        ]
      },
      {
        "type": "entries",
        "name": "Gnomish Lineage",
        "entries": [
          "You are part of a lineage that grants you supernatural abilities. Choose one of the following options; whichever one you choose, Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage):",
          {
            "type": "list",
            "style": "list-hang-notitle",
            "items": [
              {
                "type": "item",
                "name": "Forest Gnome",
                "entries": [
                  "You know the Minor {@rule Illusions|Illusion} cantrip. You also always have the Speak with Animals spell prepared. You can cast it without a spell slot a number of times equal to your {@rule Proficiency|Proficiency Bonus}, and you regain all expended uses when you finish a {@rule Long Rest}. You can also use any spell slots you have to cast the spell."
                ]
              },
              {
                "type": "item",
                "name": "Rock Gnome",
                "entries": [
                  "You know the {@spell Mending} and {@spell Prestidigitation} cantrips. In addition, you can spend 10 minutes casting {@spell Prestidigitation} to create a Tiny clockwork device (AC 5, 1 HP), such as a toy, fire starter, or music box. When you create the device, you determine its function by choosing one effect from {@spell Prestidigitation}; the device produces that effect whenever you or another creature takes a {@rule Bonus Action} to activate it with a touch. If the chosen effect has options within it, you choose one of those options for the device when you create it. For example, if you choose the spell's ignite-extinguish effect, you determine whether the device ignites or extinguishes fire; the device doesn't do both. You can have three such devices in existence at a time, and each falls apart 8 hours after its creation or when you dismantle it with a touch as a {@action Utilize} action."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "Goliath",
    "id": "goliath",
    "size": "M",
    "source": "PHB'24",
    "speed": "30",
    "proficiency": "Athletics",
    "traits": [
      {
        "name": "Age",
        "text": ["Goliaths have lifespans comparable to humans. They enter adulthood in their late teens and usually live less than a century."]
      },
      {
        "name": "Alignment",
        "text": ["Goliath society, with its clear roles and tasks, has a strong lawful bent. The goliath sense of fairness, balanced with an emphasis on self sufficiency and personal accountability, pushes them toward neutrality."]
      },
      {
        "name": "Size",
        "text": ["Goliaths are between 7 and 8 feet tall and weigh between 280 and 340 pounds. Your size is Medium."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Giant Ancestry",
        "entries": [
          "You are descended from Giants. Choose one of the following benefits—a supernatural boon from your ancestry; you can use the chosen benefit a number of times equal to your {@rule Proficiency|Proficiency Bonus}, and you regain all expended uses when you finish a {@rule Long Rest}:",
          {
            "type": "list",
            "style": "list-hang-notitle",
            "items": [
              {
                "type": "item",
                "name": "Cloud's Jaunt (Cloud Giant)",
                "entries": [
                  "As a {@rule Bonus Action}, you magically teleport up to 30 feet to an unoccupied space you can see."
                ]
              },
              {
                "type": "item",
                "name": "Fire's Burn (Fire Giant)",
                "entries": [
                  "When you hit a target with an attack roll and deal damage to it, you can also deal {@damage 1d10} Fire damage to that target."
                ]
              },
              {
                "type": "item",
                "name": "Frost's Chill (Frost Giant)",
                "entries": [
                  "When you hit a target with an attack roll and deal damage to it, you can also deal {@damage 1d6} Cold damage to that target and reduce its {@rule Speed} by 10 feet until the start of your next turn."
                ]
              },
              {
                "type": "item",
                "name": "Hill's Tumble (Hill Giant)",
                "entries": [
                  "When you hit a Large or smaller creature with an attack roll and deal damage to it, you can give that target the {@condition Prone} condition."
                ]
              },
              {
                "type": "item",
                "name": "Stone's Endurance (Stone Giant)",
                "entries": [
                  "When you take damage, you can take a {@rule Reaction} to roll {@dice 1d12}. Add your Constitution modifier to the number rolled and reduce the damage by that total."
                ]
              },
              {
                "type": "item",
                "name": "Storm's Thunder (Storm Giant)",
                "entries": [
                  "When you take damage from a creature within 60 feet of you, you can take a {@rule Reaction} to deal {@damage 1d8} Thunder damage to that creature."
                ]
              }
            ]
          }
        ]
      },
      {
        "type": "entries",
        "name": "Large Form",
        "entries": [
          "Starting at character level 5, you can change your size to Large as a {@rule Bonus Action} if you're in a big enough space. This transformation lasts for 10 minutes or until you end it (no action required). For that duration, you have {@rule Advantage} on Strength checks, and your {@rule Speed} increases by 10 feet. Once you use this trait, you can't use it again until you finish a {@rule Long Rest}."
        ]
      },
      {
        "type": "entries",
        "name": "Powerful Build",
        "entries": [
          "You have {@rule Advantage} on any ability check you make to end the {@condition Grappled} condition. You also count as one size larger when determining your carrying capacity."
        ]
      }
    ]
  },
  {
    "name": "Halfling",
    "id": "halfling",
    "size": "S",
    "source": "PHB'24",
    "speed": "30",
    "traits": [
      {
        "name": "Age",
        "text": ["A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century."]
      },
      {
        "name": "Alignment",
        "text": ["Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways."]
      },
      {
        "name": "Size",
        "text": ["Halflings average about 3 feet tall and weigh about 40 pounds. You size is small."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Brave",
        "entries": [
          "You have {@rule Advantage} on saving throws you make to avoid or end the {@condition Frightened} condition."
        ]
      },
      {
        "type": "entries",
        "name": "Halfling Nimbleness",
        "entries": [
          "You can move through the space of any creature that is a size larger than you, but you can't stop in the same space."
        ]
      },
      {
        "type": "entries",
        "name": "Luck",
        "entries": [
          "When you roll a 1 on the {@dice d20} of a {@rule D20 Test}, you can reroll the die, and you must use the new roll."
        ]
      },
      {
        "type": "entries",
        "name": "Naturally Stealthy",
        "entries": [
          "You can take the {@action Hide} action even when you are obscured only by a creature that is at least one size larger than you."
        ]
      }
    ]
  },
  {
    "name": "Human",
    "id": "human",
    "source": "PHB'24",
    "size": "M",
    "speed": "30",
    "traits": [
      {
        "name": "Age",
        "text": ["Humans reach adulthood in their late teens and live less than a century."]
      },
      {
        "name": "Alignment",
        "text": ["Humans tend toward no particular alignment."]
      },
      {
        "name": "Size",
        "text": ["Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Resourceful",
        "entries": [
          "You gain {@rule Heroic Inspiration} whenever you finish a {@rule Long Rest}."
        ]
      },
      {
        "type": "entries",
        "name": "Skillful",
        "entries": [
          "You gain proficiency in one skill of your choice."
        ]
      },
      {
        "type": "entries",
        "name": "Versatile",
        "entries": [
          "You gain an {@feat feat?feat-category-filter=O|Origin feat} of your choice."
        ]
      }
    ]
  },
  {
    "name": "Orc",
    "id": "orc",
    "size": "M",
    "source": "PHB'24",
    "speed": "30",
    "traits": [
      {
        "name": "Age",
        "text": ["Orcs mature a faster than humans, reaching adulthood around age 12. They age noticeably faster and rarely live longer than 65 years."]
      },
      {
        "name": "Alignment",
        "text": ["Orcs have a tendency toward chaos. Orcs raised in societies that still worship the original Orcish god Gruumsh are usually evil."]
      },
      {
        "name": "Size",
        "text": ["Orcs are larger and bulkier than humans, and they range from 6 to well over 7 feet tall. Your size is Medium."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Adrenaline Rush",
        "entries": [
          "You can take the {@action Dash|XPHB} action as a {@rule Bonus Action|XPHB}. When you do so, you gain a number of {@rule Temporary Hit Points|XPHB} equal to your {@rule Proficiency|XPHB|Proficiency Bonus}.",
          "You can use this trait a number of times equal to your {@rule Proficiency|XPHB|Proficiency Bonus}, and you regain all expended uses when you finish a {@rule Short Rest|XPHB|Short} or {@rule Long Rest|XPHB}."
        ]
      },
      {
        "type": "entries",
        "name": "Darkvision",
        "entries": [
          "You have {@sense Darkvision|XPHB} with a range of 120 feet."
        ]
      },
      {
        "type": "entries",
        "name": "Relentless Endurance",
        "entries": [
          "When you are reduced to 0 {@rule Hit Points|XPHB} but not killed outright, you can drop to 1 {@rule Hit Points|XPHB|Hit Point} instead. Once you use this trait, you can't do so again until you finish a {@rule Long Rest|XPHB}."
        ]
      }
    ]
  },
  {
    "name": "Tiefling",
    "id": "tiefling",
    "size": "M",
    "source": "PHB'24",
    "speed": "30",
    "traits": [
      {
        "name": "Age",
        "text": ["Tieflings mature at the same rate as humans but live a few years longer."]
      },
      {
        "name": "Alignment",
        "text": ["Tieflings might not have an innate tendency toward evil, but because of their circumstances, many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment."]
      },
      {
        "name": "Size",
        "text": ["Tieflings are about the same size and build as humans. Your size is Medium."]
      }
    ],
    "entries": [
      {
        "type": "entries",
        "name": "Darkvision",
        "entries": [
          "You have {@sense Darkvision} with a range of 60 feet."
        ]
      },
      {
        "type": "entries",
        "name": "Fiendish Legacy",
        "entries": [
          "You are the recipient of a legacy that grants you supernatural abilities. Choose a legacy from the Fiendish Legacies table. You gain the level 1 benefit of the chosen legacy.",
          "When you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a {@rule Long Rest}. You can also cast the spell using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the legacy).",
          {
            "type": "table",
            "caption": "Fiendish Legacies",
            "colLabels": [
              "Legacy",
              "Level 1",
              "Level 3",
              "Level 5"
            ],
            "colStyles": [
              "col-2",
              "col-6",
              "col-2",
              "col-2"
            ],
            "rows": [
              [
                "Abyssal",
                "You have Resistance to Poison damage. You also know the {@spell Poison Spray} cantrip.",
                "{@spell Ray of Sickness}",
                "{@spell Hold Person}"
              ],
              [
                "Chthonic",
                "You have Resistance to Necrotic damage. You also know the {@spell Chill Touch} cantrip.",
                "{@spell False Life}",
                "{@spell Ray of Enfeeblement}"
              ],
              [
                "Infernal",
                "You have Resistance to Fire damage. You also know the {@spell Fire Bolt} cantrip.",
                "{@spell Hellish Rebuke}",
                "{@spell Darkness}"
              ]
            ]
          }
        ]
      },
      {
        "type": "entries",
        "name": "Otherworldly Presence",
        "entries": [
          "You know the {@spell Thaumaturgy} cantrip. When you cast it with this trait, the spell uses the same spellcasting ability you use for your Fiendish Legacy Trait."
        ]
      }
    ]
  }
]
